# Intro python data science
## Práctica 05: pandas dataframe

Vamos a ver cómo:
* Punto 1: Crear dataframes
* Punto 2: Seleccionar elementos
* Punto 3: Ordenar columnas

# Punto 1:

In [1]:
# importar pandas
import pandas as pd

In [2]:
# datos de RRSS 2020
fbk = ['Facebook', 2449, True, 2006]
twt = ['Twitter', 339, False, 2006]
ig = ['Instagram', 1000, True, 2010]
yt = ['YouTube', 2000, False, 2005]
lkn = ['LinkedIn', 663, False, 2003]
wsp = ['WhatsApp', 1600, True, 2009]

In [3]:
lista_rrss = [fbk, twt, ig, yt, lkn, wsp]

In [8]:
# crear dataframe a partir de listas
dt_rrss=pd.DataFrame(lista_rrss,
            columns= ['Nombre', 'Cantidad','Es_FKB','Ano'])
dt_rrss

      Nombre  Cantidad  Es_FKB   Ano
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
2  Instagram      1000    True  2010
3    YouTube      2000   False  2005
4   LinkedIn       663   False  2003
5   WhatsApp      1600    True  2009

In [9]:
# crear dataframe vacio
dt_vacio=pd.DataFrame(columns= ['Nombre', 'Cantidad','Es_FKB','Ano'])
dt_vacio

Empty DataFrame
Columns: [Nombre, Cantidad, Es_FKB, Ano]
Index: []

##### dt_vacio

In [11]:
dt_vacio=dt_vacio.append({'Nombre':'Facebook', 
                          'Cantidad':4050,'Es_FKB':True,'Ano':2043}, ignore_index=True)

In [12]:
dt_vacio

     Nombre Cantidad Es_FKB   Ano
0  Facebook     4050   True  2043

# Punto 2:

In [ ]:
# seleccionar elementos: .loc vs .iloc

In [13]:
dt_rrss

      Nombre  Cantidad  Es_FKB   Ano
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
2  Instagram      1000    True  2010
3    YouTube      2000   False  2005
4   LinkedIn       663   False  2003
5   WhatsApp      1600    True  2009

In [14]:
# seleccionar un elemento por etiquetas
dt_rrss.loc[1,'Nombre']

'Twitter'

In [15]:
# seleccionar un elemento por número
dt_rrss.iloc[1,0]

'Twitter'

In [16]:
# seleccionar por columnas/fila
dt_rrss['Nombre']

0     Facebook
1      Twitter
2    Instagram
3      YouTube
4     LinkedIn
5     WhatsApp
Name: Nombre, dtype: object

In [17]:
# seleccionar por fila
dt_rrss.iloc[4]

Nombre      LinkedIn
Cantidad         663
Es_FKB         False
Ano             2003
Name: 4, dtype: object

In [ ]:
# seleccionar por condicion booleana

In [18]:
dt_rrss['Cantidad']>1500

0     True
1    False
2    False
3     True
4    False
5     True
Name: Cantidad, dtype: bool

In [19]:
dt_rrss[dt_rrss['Cantidad']>1500]

     Nombre  Cantidad  Es_FKB   Ano
0  Facebook      2449    True  2006
3   YouTube      2000   False  2005
5  WhatsApp      1600    True  2009

# Punto 3:

In [ ]:
# Como ordenar columnas

In [21]:
# ordenar modo ascendente: de menor a mayor
dt_rrss.sort_values('Nombre', ascending=True)

      Nombre  Cantidad  Es_FKB   Ano
0   Facebook      2449    True  2006
2  Instagram      1000    True  2010
4   LinkedIn       663   False  2003
1    Twitter       339   False  2006
5   WhatsApp      1600    True  2009
3    YouTube      2000   False  2005

In [23]:
# ordenar descendente: de mayor a menor
dt_rrss.sort_values('Ano', ascending=False)

      Nombre  Cantidad  Es_FKB   Ano
2  Instagram      1000    True  2010
5   WhatsApp      1600    True  2009
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
3    YouTube      2000   False  2005
4   LinkedIn       663   False  2003

In [ ]:
# ordenar por dos valores

In [26]:
# ordenar por dos columnas
dt_rrss.sort_values(['Nombre','Ano'], ascending=[True,False])

      Nombre  Cantidad  Es_FKB   Ano
0   Facebook      2449    True  2006
2  Instagram      1000    True  2010
4   LinkedIn       663   False  2003
1    Twitter       339   False  2006
5   WhatsApp      1600    True  2009
3    YouTube      2000   False  2005

# LISTO P-DS!
## Leonel en-notebook 😀